#+begin_src emacs-lisp
  (save-buffer)
  (org-babel-tangle)
  (async-shell-command "./do_copy.sh" "log" "err")
#+end_src

#+RESULTS:
: #<window 450 on log>

#+begin_src conf :tangle ./alacritty.toml
  [window]
  decorations = "None"
  startup_mode = "Fullscreen"

  [font]
  size = 16
#+end_src

#+begin_src sh :shebang #!/bin/sh :results output :tangle ./do_copy.sh
  mkdir -pv -- "${HOME}/.config/alacritty/"
  cp -vf -- './alacritty.toml' "${HOME}/.config/alacritty/alacritty.toml"
#+end_src
